Comment: Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Soundplant 59.
Identifier: com.github.pnerum.download.Soundplant59
Input:
  NAME: Soundplant 59
MinimumVersion: '2.3'
Process:
- Arguments:
    filename: '%NAME%.dmg'
    url: https://soundplant.org/downloads/Soundplant59.dmg
  Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    input_path: '%pathname%/Soundplant 59.app'
    requirement: identifier "com.marcelblum.soundplant" and anchor apple generic and
      certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
      /* exists */ and certificate leaf[subject.OU] = D5248G4KN9
  Processor: CodeSignatureVerifier
- Arguments:
    input_plist_path: '%pathname%/Soundplant 59.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
  Processor: Versioner
